Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
pl: To zadanie najpierw pożycza odniesienie do ``list[0]``, potem zamienia ``list[1] na wartość ``0``, i ostatecznie wypisuje pożyczone odniesienie. Wydaje się nieszkodliwe, czyż nie? A jednak jest!

source: Let's follow the control flow into :cfunc:`PyList_SetItem`. The list owns references to all its items, so when item 1 is replaced, it has to dispose of the original item 1. Now let's suppose the original item 1 was an instance of a user-defined class, and let's further suppose that the class defined a :meth:`__del__` method. If this class instance has a reference count of 1, disposing of it will call its :meth:`__del__` method.
pl: Prześledźmy przepływ wykonania wchodzący do :cfunc:`PyList_SetItem`. Lista posiada odniesienia do wszystkich swoich elementów, więc gdy element pierwszy jest zamieniany, musi pozbyć się pierwotnego elementu pierwszego. A teraz załóżmy, że pierwotny element pierwszy był przykładem zdefiniowanego-przez-użytkownika uogólnienia, i załóżmy także że uogólnienie określało sposób postępowania :meth:`__del__`. Jeśli ten przykład uogólnienia miał liczbę odniesień równą jeden, pozbywając się go wywoła on swój sposób postępowania :meth:`__del__`.

source: Since it is written in Python, the :meth:`__del__` method can execute arbitrary Python code. Could it perhaps do something to invalidate the reference to ``item`` in :cfunc:`bug`? You bet! Assuming that the list passed into :cfunc:`bug` is accessible to the :meth:`__del__` method, it could execute a statement to the effect of ``del list[0]``, and assuming this was the last reference to that object, it would free the memory associated with it, thereby invalidating ``item``.
pl: Ponieważ jest to napisane w języku pytonowskim, sposób postępowania :meth:`__del__` może wykonać dowolny kod języka pytonowskiego. Mógłby być może zrobić coś, co unieważniłoby odniesienie do ``elementu`` w zadaniu :cfunc:`bug`? Można się założyć że tak! Przyjmując założenie, że lista przekazana do zadania :cfunc:`bug` jest dostępna dla sposobu postępowania :meth:`__del__, mogłoby wykonać wyrażenie efektywnego ``del list[0]`` i zakładając że to było ostatnie odniesienie do tego przedmiotu, to uwolniłoby pamięć związaną z nią, tym samym unieważniając ``element``.

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
pl: Rozwiązanie, gdy znasz już źródło problemu, jest łatwe: tymczasowo zwiększyć ilość odniesień. Poprawna wersja zadania równa jest::

source: void no_bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); Py_INCREF(item); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); Py_DECREF(item); }
pl: void no_bug(PyObject *list) { PyObject *element = PyList_GetItem(list, 0); Py_INCREF(element); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(element, stdout, 0); Py_DECREF(element); }

source: This is a true story. An older version of Python contained variants of this bug and someone spent a considerable amount of time in a C debugger to figure out why his :meth:`__del__` methods would fail...
pl: To jest prawdziwa historia. Starsza wersja języka pytonowskiego zawierała warianty tego błędu i ktoś spędził zdrowy kawałek czasu w debugerze C aby dowiedzieć się czemu jegosposoby postępowania :meth:`__del__` zawodziły...

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a global lock protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :cmacro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :cmacro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
pl: Drugim przypadkiem problemów z pożyczonym odniesieniem jest wariant zajmujący się wątkami. Zwykle, wiele wątków w programie interpretującym polecenia języka pytonowskiego nie może wchodzić sobie nawzajem w drogę, ponieważ istnieje nadrzędna blokada chroniąca całą przestrzeń przedmiotów języka pytonowskiego. Jednakże, jest możliwe tymczasowo zwolnić tą blokadę używając makropolecenia :cmacro:`Py_BEGIN_ALLOW_THREADS`, i ponownie je przejąć używając :cmacro:`Py_END_ALLOW_THREADS`. To jest częste przy blokowaniu wywołań wejścia/wyjścia, aby pozwalać innym wątkom używać procesora czekając na wejście/wyjście aby zostało zakończone. Oczywiste jest, że następujące zadanie ma ten sam problem co poprzednie::

source: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); Py_BEGIN_ALLOW_THREADS ...some blocking I/O call... Py_END_ALLOW_THREADS PyObject_Print(item, stdout, 0); /* BUG! */ }
pl: void bug(PyObject *list) { PyObject *element = PyList_GetItem(list, 0); Py_BEGIN_ALLOW_THREADS ...pewne operacje blokujące we/wy... Py_END_ALLOW_THREADS PyObject_Print(element, stdout, 0); /* BŁĄD! */ }

source: NULL Pointers
pl: Puste wskaźniki (NULL)

source: In general, functions that take object references as arguments do not expect you to pass them *NULL* pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return *NULL* only to indicate that an exception occurred. The reason for not testing for *NULL* arguments is that functions often pass the objects they receive on to other function --- if each function were to test for *NULL*, there would be a lot of redundant tests and the code would run more slowly.
pl: Zwykle, zadania, które pobierają odniesienia do przedmiotów jako parametry nie oczekują abyś przekazywał im puste (*NULL*) wskaźniki, i zrzucą jądro (lub spowodują późniejsze zrzucenie jądra) jeśli to wykonasz. Zadania które zwracają odniesienia do przedmiotu zwykle zwracają *NULL* tylko aby zaznaczyć że nastąpił wyjątek. Przyczyną nie sprawdzania parametrów czy są *NULL* jest to, że zadania często przekazują przedmioty które otrzymują dalej do innych zadań --- jeśli każde zadanie miałoby sprawdzać czy jego parametry są *NULL*, byłoby mnóstwo nadmiarowych testów i kod działałby dużo wolniej.

source: It is better to test for *NULL* only at the "source:" when a pointer that may be *NULL* is received, for example, from :cfunc:`malloc` or from a function that may raise an exception.
pl: Jest lepiej sprawdzać czy jest *NULL* tylko u "źródła:" gdy wskaźnik, który mógłby być *NULL* jest otrzymywany, na przykład, z :cfunc:`malloc` lub z zadania które mogłoby zgłosić wyjątek.

source: The macros :cfunc:`Py_INCREF` and :cfunc:`Py_DECREF` do not check for *NULL* pointers --- however, their variants :cfunc:`Py_XINCREF` and :cfunc:`Py_XDECREF` do.
pl: Makropolecenia :cfunc:`Py_INCREF` i :cfunc:`Py_DECREF` nie sprawdzają wskaźników *NULL* --- jednakże w ich odmianie :cfunc:Py_XINCREF` i :cfunc:`Py_XDECREF` sprawdzają.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for *NULL* pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with *NULL* checking.
pl: Makropolecenia dla sprawdzenia szczególnego rodzaju przedmiotu(``Pytype_Check()``) nie sprawdzają pustych (*NULL*) wskaźników --- znów, istnieje dużo kodu który wywołuje kilka z tych w rzędzie aby sprawdzić czy przedmiot jest typu jednego z kilku różnych oczekiwanych, i to powodowałoby nadmiarowe sprawdzenia. Nie ma wariantu ze sprawdzaniem *NULL*.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never *NULL* --- in fact it guarantees that it is always a tuple. [#]_
pl: Mechanizm wywołań zadań z języka C gwarantuje, że lista parametrów przekazywana do zadania C (``args`` w przykładach) nigdy nie jest *NULL* --- faktycznie gwarantuje że to zawsze jest krotka. [#]_

source: It is a severe error to ever let a *NULL* pointer "escape" to the Python user.
pl: Jest to poważnym błędem aby pozwolić aby pusty *NULL* wskaźnik "uciekł" do użytkownika języka pytonowskiego.

source: Writing Extensions in C++
pl: Pisanie rozszerzeń w C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
pl: Jest możliwe pisanie modułów rozszerzających w C++. Niektóre ograniczenia obowiązują. Jeśli główny program (program interpretujący polecenia języka pytonowskiego) jest kompilowany i łączony przez kompilator języka C, nadrzędne lub statyczne przedmioty z konstruktorami nie mogą być używane. To nie jest problemem jeśli główny program jest łączony przez kompilator C++. Zadania które będą wezwane przez program interpretujący polecenia języka pytonowskiego (w szczególności, zadania inicjujące moduł) muszą być deklarowane używając ``extern "C"``. Nie jest to konieczne aby zawierać plik nagłówkowy języka pytonowskiego w ``extern "C" {...}`` --- one używają już tej formy jeśli symbol ``__cplusplus`` jest zdefiniowany (wszystkie niedawne kompilatory C++ definiują ten symbol).

source: Providing a C API for an Extension Module
pl: Dostarczanie sprzęgu programowania aplikacji (API) języka C dla modułu rozszerzającego

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
pl: Wiele modułów rozszerzających po prostu dostarcza nowych zadań i typów aby były używane z języka pytonowskiego, ale czasami kod w module rozszerzającym może być użyteczny dla innych rozszerzających modułów. Na przykład, moduł rozszerzający mógłby wypełniać typ "kolekcji" który działałby jak lista bez wprowadzonego porządku. Tak jak standardowy typ listy języka pytonowskiego posiada sprzęg programowania aplikacji języka C, który pozwala modułom rozszerzającym tworzenie i zmianę list, ten nowy typ kolekcji powinien mieć zbiór zadań C dla bezpośrednich zmian z innych modułów rozszerzających.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
pl: Na pierwszy rzut oka to wydaje się proste: napisać zadania (bez deklarowania ich jako ``statycznych``, oczywiście), dostarczyć odpowiedni plik nagłówkowy, i udokumentować sprzęg programowania aplikacji (API) C. I faktycznie to mogłoby zadziałać jeśli wszystkie rozszerzające moduły byłyby zawsze złączone statycznie z programem interpretującym polecenia języka pytonowskiego. Gdy moduły są używane jako współdzielone biblioteki, jednakże, symbole zdefiniowane w jednym module mogą nie być widoczne dla innych modułów. Szczegóły widoczności zależą od systemu operacyjnego; niektóre systemy używają jednej nadrzędnej przestrzeni nazw dla programu interpretującego polecenia języka pytonowskiego i wszystkich modułów rozszerzających (dla Windows, na przykład), podczas gdy inne wymagają jawnej listy importowanych symboli w czasie łączenia modułów (AIX jest jednym z przykładów), lub oferują wybór różnych strategii (większość Unix-ów). I nawet jeśli symbole są widoczne nadrzędnie, moduł którego zadania ktoś chciałby uruchomić mogły nie zostać jeszcze załadowane!

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
pl: Przenośność zatem wymaga aby nie czynić żadnych założeń o widoczności symboli. To oznacza, że wszystkie symbole w rozszerzających modułach powinny być deklarowane jako ``statyczne``, z wyjątkiem zadania zainicjowania modułu, w celu ominięcia wojen nazw z innymi modułami rozszerzającymi (jak określono w rozdziale :ref:`methodtable` - z ang. - :ref:`tabela sposobów postępowania`). I to oznacza, że symbole, które *powinny* być dostępne z innych rozszerzających modułów muszą być eksportowane w różny sposób.

source: Python provides a special mechanism to pass C-level information (pointers) from one extension module to another one: Capsules. A Capsule is a Python data type which stores a pointer (:ctype:`void \*`). Capsules can only be created and accessed via their C API, but they can be passed around like any other Python object. In particular, they can be assigned to a name in an extension module's namespace. Other extension modules can then import this module, retrieve the value of this name, and then retrieve the pointer from the Capsule.
pl: Język pytonowski dostarcza specjalny mechanizm aby przekazać informację na-poziomie-języka-C (wskaźniki) z jednego rozszerzenia do innego: Kapsuły. Kapsuły są typem danych języka pytonowskiego, które przechowują wskaźnik (:ctype:`void \*`). Kapsuły mogą tylko być tworzone i dostęp do nich może tylko być otrzymywany przez ich sprzęg programowania aplikacji (API) C, ale one nie mogą być przekazywane postronnie jak inne przedmioty języka pytonowskiego. W szczególności, mogą być przypisane do nazwy w przestrzeni nazw modułu rozszerzającego. Inne rozszerzające moduły mogą wtedy importować ten moduł, odebrać wartość tej nazwy, i wtedy odebrać wskaźnik z kapsuły.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
pl: Istnieje wiele sposobów w jakie kapsuły mogą być używane aby wystawiać na zewnątrz sprzęgi programowania aplikacji (API) języka C dla danego modułu rozszerzającego. Każde zadanie mogłoby dostać swoją własną kapsułę, lub wszystkie wskaźniki sprzęgu programowania aplikacji (API) języka C mogłyby być zachowane w tabeli której adres byłby opublikowany w kapsule. A różne zadania zachowania i odbioru wskaźników mogłyby być rozprowadzone na różne sposoby pomiędzy moduły dostarczające kod i moduły odbierające.

source: Whichever method you choose, it's important to name your Capsules properly. The function :cfunc:`PyCapsule_New` takes a name parameter (:ctype:`const char \*`); you're permitted to pass in a *NULL* name, but we strongly encourage you to specify a name. Properly named Capsules provide a degree of runtime type-safety; there is no feasible way to tell one unnamed Capsule from another.
pl: Którejkolwiek metody nie wybrałbyś, jest istotne aby nazywać swoje kapsuły odpowiednio. Zadanie :cfunc:`PyCapsule_New` przyjmuje nazwę parametru (:ctype:`const char \*`); wolno Ci przekazać pustą nazwę *NULL*, ale silnie zachęcamy Cię byś określił nazwę. Poprawnie nazwana kapsuła dostarcza pewien poziom bezpieczeństwa-typów w czasie wykonania; nie ma żadnego możliwego sposobu aby odróżnić jedną nienazwaną kapsułę od drugiej.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
pl: W szczególności, kapsułom używanym do wystawiania sprzęgów programowania aplikacji języka C ( - z ang. - API) powinna być nadana nazwa stosująca się do następującej konwencji::

source: The convenience function :cfunc:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
pl: Zadanie sprzyjania :cfunc:`PyCapsule_Import` czyni łatwym aby ładować sprzęg programowania aplikacji w języku C dostarczony przez kapsułę, ale tylko jeśli nazwa kapsuły pasuje do tej konwencji. To zachowanie daje użytkownikom sprzęgu programowania aplikacji w języku C ( z ang. - API) wysokiego poziomu pewność że kapsuła którą ładują zawiera poprawny sprzęg programowania aplikcji w języku C.

source: The following example demonstrates an approach that puts most of the burden on the writer of the exporting module, which is appropriate for commonly used library modules. It stores all C API pointers (just one in the example!) in an array of :ctype:`void` pointers which becomes the value of a Capsule. The header file corresponding to the module provides a macro that takes care of importing the module and retrieving its C API pointers; client modules only have to call this macro before accessing the C API.
pl: Następujący przykład demonstruje podejście które nakłada większość obciążenia na piszącym wystawiający na zewnątrz moduł, który jest właściwy dla wspólnie używanych modułów bibliotecznych. On przechowuje wszystkie wskaźniki sprzęgu programowania aplikcaji w języku C ( - z ang. - C API) (tylko jeden w tym przykładzie!) w tabeli wskaźników :ctype:`void`, które stają się wartością kapsuły. Plik nagłówkowy, odpowiadający modułowi dostarcza makropolecenie które zajmuje się importowaniem modułu i odbieraniem jego wskaźników sprzęgu programowania aplikacji w języku C ( - z ang. - C API); Moduły korzystające muszą tylko wezwać to makropolecenie przed dostępem do sprzęgu programowania aplikacji w języku C ( - z ang. - C API)

source: The exporting module is a modification of the :mod:`spam` module from section :ref:`extending-simpleexample`. The function :func:`spam.system` does not call the C library function :cfunc:`system` directly, but a function :cfunc:`PySpam_System`, which would of course do something more complicated in reality (such as adding "spam" to every command). This function :cfunc:`PySpam_System` is also exported to other extension modules.
pl: Eksportujący moduł jest modyfikacją modułu :mod:`spam` z sekcji :ref:`prosty-przykład-rozszerzania` - z ang - :ref:`extending-simpleexample`. Zadanie :func:`spam.system` nie wzywa zadania bibliotecznego z języka C :cfunc:`system` bezpośrednio, ale zadanie :cfunc:`PySpam_System`, który zrobiłby oczywiście coś bardziej skomplikowanego w rzeczywistości (takiego, jak dodanie "spam" do każdego polecenia). To zadanie :cfunc:`PySpam_System` jest także wystawiane na zewnątrz do innych modułów rozszerzających.

source: The function :cfunc:`PySpam_System` is a plain C function, declared ``static`` like everything else::
pl: Zadanie :cfunc:`PySpam_System` jest czystym zadaniem C, zadeklarowanym statycznie - z ang. - ``static`` jak wszystko inne::

source: The function :cfunc:`spam_system` is modified in a trivial way::
pl: Zadanie :cfunc:`spam_system` jest zmodyfikowane w trywialny sposób::

source: In the beginning of the module, right after the line ::
pl: Na początku modułu, zaraz za linią ::

source: two more lines must be added::
pl: muszą być dodane dwie linie::

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's initialization function must take care of initializing the C API pointer array::
pl: ``#define`` jest używane aby przekazać plikowi nagłówkowemu że jest załączany w module wystawianym na zewnątrz, nie w module któremu wszystko służy. Ostatecznie zadanie inicjowania musi zadbać o zainicjowanie tabeli wskaźników sprzęgu programowania aplikacji języka C.

source: PyMODINIT_FUNC PyInit_spam(void) { PyObject *m; static void *PySpam_API[PySpam_API_pointers]; PyObject *c_api_object; m = PyModule_Create(&spammodule); if (m == NULL) return NULL; /* Initialize the C API pointer array */ PySpam_API[PySpam_System_NUM] = (void *)PySpam_System; /* Create a Capsule containing the API pointer array's address */ c_api_object = PyCapsule_New((void *)PySpam_API, "spam._C_API", NULL); if (c_api_object != NULL) PyModule_AddObject(m, "_C_API", c_api_object); return m; }
pl: PyMODINIT_FUNC PyInit_spam(void) { PyObject *m; static void *PySpam_API[PySpam_API_pointers]; PyObject *c_api_object; m = PyModule_Create(&spammodule); if (m == NULL) return NULL; /* Zainicjuj tabelę wskaźników C API */ PySpam_API[PySpam_System_NUM] = (void *)PySpam_System; /* Utwórz kapsułę zawierającą adres tabeli wskaźników API */ c_api_object = PyCapsule_New((void *)PySpam_API, "spam._C_API", NULL); if (c_api_object != NULL) PyModule_AddObject(m, "_C_API", c_api_object); return m; }

source: Note that ``PySpam_API`` is declared ``static``; otherwise the pointer array would disappear when :func:`PyInit_spam` terminates!
pl: Zauważ, że ``PySpam_API`` jest zadeklarowane ``statycznie``; w innym przypadku tabela wskaźników zniknęłaby gdy :func:`PyInit_spam` się zakończy!

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
pl: Większa część pracy jest wykonywana w pliku nagłówkowym :file:`spammodule.h`, który wygląda następująco::
